% 测试GetJ6Point函数
clc; clear;

% 1. 定义机器人参数
config.L1 = 491;  % mm
config.L2 = 450;  % mm
config.L3 = 450;  % mm


% 2. 设定真实关节角
theta_true = [-3.395,33.387,109.556,-3.163,33.54,-9.33]./180*pi;

% 3. 初始化螺旋轴和基座矩阵
w0 = [0,0,0,0,0,0; 0,1,1,0,1,0; 1,0,0,1,0,1];
q0 = [0,0,0,0,0,0; 0,0,0,0,0,0; 0,491,941,1391,1391,1391];
T0 = [-1,0,0,0; 0,-1,0,0; 0,0,1,1391; 0,0,0,1];
x0 = zeros(6,6);
for i = 1:6
    w_i = w0(1:3,i);
    q_i = q0(1:3,i);
    x0(1:3,i) = -cross(w_i, q_i);
    x0(4:6,i) = w_i;
end


p_j6_point = GetJ6Point(theta_true)
T = Fkine(x0, theta_true, T0)




